include/GLANGSoapBinding.base_information_content.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://localhost/GLANG">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:base_information_content>
   <sequence></sequence>
   <params>
    <upstream>0</upstream>
    <position></position>
    <downstream>0</downstream>
    <output></output>
    <PatLength>0</PatLength>
   </params>
  </ns1:base_information_content>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
